EventBraite/app/controllers/avatars_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def create
  	@event = Event.find(params[:event_id])